/*
В американській армії вважається "нещасливим" число 13, а
в китайській — 4. Перед спільними навчаннями з
американською та китайською армією, штаб української
армії вирішив вилучити номери бойової техніки, що містять
числа 4 або 13 (наприклад, 40123, 13373, 12345 або 61342),
щоб не бентежити іноземних колег.
Напишіть програму, яка виведе на екран, скільки всіх номерів
доведеться вилучити, якщо у розпорядженні армії є 100 тисяч
одиниць бойової техніки і кожна бойова машина має номер від
00000 до 99999. Розв'яжіть, використовуючи рядки
 */

public class Task06 {
    public static void main(String[] args) {
        int count = 0;

        for (int i = 0; i <= 99999; i++) {
            String number = String.format("%05d", i);

            if (number.contains("4") || number.contains("13")) {
                count++;
            }
        }

        System.out.println("Кількість номерів, що доведеться вилучити: " + count);
    }
}
