/*
Просте число — це натуральне число, яке має два різні,
натуральні дільники — одиницю і себе. Іншими словами, число
N єпростим, якщо воно більше 1 і при цьому ділиться без остачі
тільки на 1 і на N (на себе).
Напишіть програму, яка виводить на екран всі прості числа в
діапазоні від 2 до 1 000 000. Намагайтеся не виконувати зайві дії
(наприклад, після того як ви знайшли хоча б один незвичний
дільник, вже зрозуміло, що число складене і перевірку
продовжувати не потрібно). Також враховуйте, що найменший
дільник натурального числа n, якщо він взагалі є, обов'язково
розташовується у відрізку [2; n].
 */

public class Task02 {
    public static void main(String[] args) {
        System.out.println("\nНатуральні числа, які знаходяться у зазначеному діапазоні: ");

        int low = 10;
        int high = 1000000;

        for (int number = low; number <= high; number++) {
            boolean isPrime = true;

            for (int i = 2; i <= Math.sqrt(number); i++) {
                if (number % i == 0) {
                    isPrime = false;
                    break;
                }
            }
            if (isPrime) {
                System.out.println(number);
            }
        }
    }
}
