/*
Числа Фібоначчі — елементи числової послідовності, в якій
перші два числа дорівнюють 0 і 1, а кожне наступне число
дорівнює сумі двох попередніх чисел.
Виведіть на екран всі числа Фібоначчі в діапазоні від 0 до
10 000 000
 */


public class Task01 {
    public static void main(String[] args) {
        int i = 0;
        int j = 1;

        System.out.println("Числа Фібоначчі в діапазоні від 0 до 10 000 000: ");
        System.out.print(i + ", ");

        while (j <= 10000000) {
            System.out.print(j + ", ");
            int next = i + j;
            i = j;
            j = next;
        }

    }
}
