/*
Якщо перелічити всі натуральні числа менше 10, кратні 3 або 5, ми
отримуємо 3, 5, 6 і 9. Сума цих кратних чисел — 23.
Знайдіть суму всіх чисел, кратних 3 або 5, починаючи з 0 і до
1 000.
 */

public class Task09 {
    public static void main(String[] args) {
        int sum = 0;

        for (int i = 0; i < 1000; i++) {
            if (i % 3 == 0 || i % 5 == 0) {
                System.out.println(i);
                sum += i;
            }
        }
        System.out.println("Сума всіх чисел, кратних 3 або 5, від 0 до 1000: " + sum);
    }
}
